################################################################################
##############        BackTesting Programming      #############################
##############        Author: William Fang         #############################
##############        Date: 2016-10-18             #############################
##############        
##############  主要修改内容：
##############  v1.1.2: 使用 Parallel Computing 重新改写原来的函数
##############  v1.1.3：=> 集成所有命令
##############          => 增加夏普比率
##############          => 增加信息比率
##############          => 增加画图功能
##############          => 增加 max draw down duration：突破前期净值高点的时长
##############                
##############        Update: 2017-02-10
##############        By    : William
##############  主要修改内容：
##############  1.从 MySQL 提取数据
##############  2.部分优化原来的程序
################################################################################

rm(list = ls())
if(Sys.info()['sysname'] == 'Windows'){
  Sys.setenv("R_ZIPCMD" = "D:/Program Files/Rtools/bin/zip.exe") ## path to zip.exe
}

## >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
################################################################################
#########################    Setting File Paths   ##############################
#########################     设置文件路径        ##############################
################################################################################
#! File path
#`
#` @r.code.path：R命令文件路径 
#` @data.file.path：数据路径
## -----------------------------------------------------------------------------
####################### file_name_main <- ""
####################### 
####################### 
####################### 
####################### file_name_sub <- ""  ## 如果有次级的；量化指标
## -----------------------------------------------------------------------------
#! r.code.path：

file_name_main <- "20170210"

r.code.path <- "D:/汉云投资/R_Coding/"

data.file.path <- "D:/汉云投资/林焕耿/"
## <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

################################################################################
## Step0: 初始参数设置
################################################################################

## >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
################################################################################
#########################    Loading  Dependent   ##############################
#########################         Packages        ##############################
################################################################################
## -----------------------------------------------------------------------------

## <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<


## >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
################################################################################
#########################   Loading Self-defined  ##############################
#########################        Functions        ##############################
################################################################################
#` @ht(): 用于显示数据的 head 与 tail，
## -----------------------------------------------------------------------------
source(paste0(r.code.path, "myInit.R"), encoding = 'UTF-8', echo=TRUE)
no.cores <- detectCores()
## <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<



################################################################################
## Step1: 初始参数设置
################################################################################

## >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
################################################################################
#########################      Initializing       ##############################
#########################       Parameters        ##############################
################################################################################
#! Parameters Initializing
#! 参数初始化设置
#`
#` @initial_capital:初始资金规模
#` @fee: 单边的交易手续费
#` @
#` @no_ohlc_backward: 往前提取 OHLC 的日期长度
#` @no_ohlc_forward: 往后提取 OHLC 的日期长度
#` @
#` @kdj_days_backwark：9,3,3
#` @kdj_ma_days：
#` @kdj_j_threshold：
#` 
## -----------------------------------------------------------------------------
#! 初始资金设定为：
initial_capital <- 50000000

#! 交易手续费设定为:
fee <- 0.002

rtn_free <- 0.00

#! 采集数据的日期
#! 往前倒推 100 日
#! 往后倒推 1000 日
no_ohlc_backward <- 1
no_ohlc_forward <- 1

## <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<






## >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
################################################################################
#########################      BackTesting #1:    ##############################
#########################       Formattting       ##############################
#########################          File           ##############################
################################################################################
## -----------------------------------------------------------------------------

setwd(paste0(data.file.path, file_name_main, "/data"))  

#```````````````````````````````````````````````````````````````````````````````

if(exists('file_name_sub')){
  file_name <- paste(file_name_main,file_name_sub, sep="_")
}else{
  file_name <- file_name_main
}

# list.files()
################################################################################
## 对于不同的 project 
################################################################################
for(i in 1:length(list.files())){
  data_name <- list.files()[i] %>% strsplit(.,"\\.") %>% unlist() %>% 
    .[1]
  dataFile <- list.files()[i] %>% 
    read_excel(., sheet = 1) %>% 
    as.data.table()
  
  # dataFile <- read_excel(paste0(file_name, ".xlsx"), sheet = 1) %>% as.data.table()
  
  #! 重新命名，方便后面写代码
  dataFile <- dataFile[,.(时间,代码,交易量)]
  colnames(dataFile) <- c("Date", "Code", "Volume")
  
  ## 转化为日期格式
  dataFile$Date <- dataFile$Date %>% as.Date()
  
  ## 修改代码显示格式为 6 位数字
  dataFile$Code <- sprintf("%06d", dataFile$Code)
  
  source('D:/myCodes/bkTesting/R/manupilate_data.R', encoding = 'UTF-8', echo=TRUE)
  
  source('D:/myCodes/bkTesting/R/quant_indicator.R', encoding = 'UTF-8', echo=TRUE)
  
  beep(8)
}

for(i in 1:length(list.files())){
  data_name <- list.files()[i] %>% strsplit(.,"\\.") %>% unlist() %>% 
    .[1]
  
  dataInfor <- read_excel(paste0("../output/",file_name, "_回测结果_",
                                 data_name,".xlsx"), sheet = "回测净值") %>% 
    as.data.table()
  
  source('D:/myCodes/bkTesting/R/nav_plot.R', encoding = 'UTF-8', echo=TRUE)
  source('D:/myCodes/bkTesting/R/volatility_plot.R', encoding = 'UTF-8', echo=TRUE)
  source('D:/myCodes/bkTesting/R/distrubution_plot.R', encoding = 'UTF-8', echo=TRUE)
}

#dataFile <- lapply(1:length(list.files()[ith]),function(i){
#  temp <- read_excel(list.files()[i], sheet = 1) %>% 
#    as.data.table()
#}) %>% rbindlist()



################################################################################
## 大拼盘
################################################################################
initial_capital <- 50000000 * length(list.files())
data_name <- as.character(getwd()) %>% strsplit(.,"/") %>% 
  unlist() %>% 
  .[which(. == "data") - 1]

dataFile <- lapply(1:length(list.files()),function(i){
  temp <- read_excel(list.files()[i], sheet = 1) %>% 
    as.data.table()
}) %>% rbindlist()

#! 重新命名，方便后面写代码
dataFile <- dataFile[,.(时间,代码,交易量)]
colnames(dataFile) <- c("Date", "Code", "Volume")

## 转化为日期格式
dataFile$Date <- dataFile$Date %>% as.Date()

## 修改代码显示格式为 6 位数字
dataFile$Code <- sprintf("%06d", dataFile$Code)

dataFile <- dataFile[, .(Volume = sum(Volume)), by = .(Date,Code)] %>% 
  .[order(Date)]

source('D:/myCodes/bkTesting/R/manupilate_data.R', encoding = 'UTF-8', echo=TRUE)

source('D:/myCodes/bkTesting/R/quant_indicator.R', encoding = 'UTF-8', echo=TRUE)

################################################################################
## 大拼盘: 画图
################################################################################
data_name <- as.character(getwd()) %>% strsplit(.,"/") %>% 
  unlist() %>% 
  .[which(. == "data") - 1]

dataInfor <- read_excel(paste0("../output/",file_name, "_回测结果_",
                               data_name,".xlsx"), sheet = "回测净值") %>% 
  as.data.table()

source('D:/myCodes/bkTesting/R/nav_plot.R', encoding = 'UTF-8', echo=TRUE)
source('D:/myCodes/bkTesting/R/volatility_plot.R', encoding = 'UTF-8', echo=TRUE)
source('D:/myCodes/bkTesting/R/distrubution_plot.R', encoding = 'UTF-8', echo=TRUE)